[
    {"version": "v1.9",
    "date": "2023-03-10",
    "notes": ["Customising sample groups in an atlas now has an option to select all/none.",
              "Fixed a bug where find similar genes in dataset view sometimes resulted in a modal window which was too large.",
              "Projecting data onto an atlas now includes projections based on random values.",
              "Capybara score algorithm in data projection onto an atlas has been slightly modified to relax the constraint of all values adding up to 1.",
              "Trying to change the columns in the Capybara score for custom_sample_group doesn't throw an error anymore."
              ]},
        
    {"version": "v1.8",
    "date": "2023-01-10",
    "notes": ["Fixed a bug where double clicking on an atlas point gave wrong sample info.",
              "Fixed a bug where double clicking on an atlas point in gene expression pca didn't work."
              ]},
        
    {"version": "v1.7",
    "date": "2022-12-31",
    "notes": ["Fixed a bug where atlas plot size preferences didn't work."
              ]},
        
    {"version": "v1.6",
    "date": "2022-12-08",
    "notes": ["Removed the reference to the single cell projection coming soon for now.",
              "Updated contact email, since the previous email address wast not working.",
              "Updated more sample and dataset metadata."]},
    
    {"version": "v1.5",
    "date": "2022-11-01",
    "notes": ["Atlas page has been redesigned based on tabs to expose all the features more easily.",
              "Atlas vignette has been updated to reflect latest changes and publications.",
              "Citation page has been updated to reflect latest papers of relevance.",
              "Old stemformatics site is no longer available."]},

    {"version": "v1.4",
     "date": "2022-07-15",
     "notes": ["Sample group items can now be ordered by drag and drop (datasets/view).",
               "There is an option to view the sample table at fixed size (datasets/view).",
               "Fixed missing link when datasets is clicked in the breadcrumb from some pages (datasets/view).",
               "Projected points are now coloured black to avoid clashing with existing colours (atlas).",
               "Failing projection comes back with more helpful error messages (atlas).",
               "Capybara plot for the projected samples in the atlas can now be downloaded (atlas)."]},

    {"version": "v1.3",
     "date": "2022-01-24",
     "notes": ["Capybara score in the atlas now scores against all atlas sample groups."]},

    {"version": "v1.2a",
     "date": "2021-10-18",
     "notes": ["Fixed a bug where gene to sample groups wasn't working."]},
   
    {"version": "v1.2",
     "date": "2021-10-15",
     "notes": ["Sample metadata has been updated, where thousands of more samples now have cell_type assigned when previously they didn't.",
                "Updated the projection vignette for the atlas to mention capybara scoring."]},

    {"version": "v1.1",
     "date": "2021-09-16",
     "notes": ["Gene search input fields have improved to handle direct user input without having to select from a list of suggestions",
               "Gene expression plot under datasets > view > genes now shows gene symbol on the plot.",
               "Updated sample metadata for many datasets for further consistency."]},

    {"version": "v1.0",
     "date": "2021-09-06",
     "notes": ["First release"]}
]